     A****************************************************************
     A*   泛太資訊科技開發股份有限公司－版權所有    TEL:7313250    *
     A*                                                              *
     A* PROGRAM NAME : PUC062                                        *
     A* AUTHER       : A1858  RACHEL                                 *
     A* CREATE DATE  : 111/02/22                                     *
     A* UPDATE DATE  :                                               *
     A* SYSTEM       :西祺進銷存                                   *
     A* SUBSYSTEM    :採購管理系統                                 *
     A* REMARK       :前台人員排班月報表                           *
     A*===============================================================
     A* MODI CODE |   DATE   | DESCRIPTION
     A*---------------------------------------------------------------
     A****************************************************************
     FPA#BPF  IF  E           K        DISK
     FMANDPF  IF  E           K        DISK
     FPUC062D CF  E                    WORKSTN
     F                                              KINFDS DSPFDS
     ILDA        UDS
     I                                      101 110 $USER
     I                                      119 1240$EGMDY
     I                                      162 1620$EVR
     I                                      125 1270$CPY
     I                                      135 135 $ADD
     I                                      598 5990$PRTID
     I                                      600 600 DOWNL
     I                                      601 602 DBG01
     I                                      603 604 DBG02
     I                                      605 6080DBG03
     I                                      605 6060D03MM
     I                                      607 6080D03YY
     I                                      609 613 DBG04S
     I                                      614 618 DBG04E
     I                                      619 6240DATE
     I*
     I* FOR F4 HELP -- GET CURSOR POSITION
     IDSPFDS      DS
     I                                    B 370 3710#CSR
      *==============================================================*
      *          IDENTIFY A PARAMETER LIST
      *==============================================================*
     C           *ENTRY    PLIST
     C           *IN03     PARM *IN03     IN03    1
     C           *IN98     PARM *IN98     IN98    1
     C           *IN97     PARM *IN97     IN97    1
      *==============================================================*
      *                    KLIST
      *==============================================================*
     C           KEYND     KLIST
     C                     KFLD           DBG01            公司別
     C                     KFLD           DBG02            通路代號
      *==============================================================*
      *                    MAIN ROUTINE
      *==============================================================*
     C  N97N98             EXSR RTN010                     .INIT SCREEN
  01-C           *IN03     DOUEQ'1'
    C*          *IN88     OREQ '1'
    C                     EXFMTDSPD1
    C                     MOVEA*ALL'0'   *IN,60
    C                     MOVEL*BLANK    DOWNL
  02-C           *IN03     IFEQ '0'
     C*
    C           *IN04     CASEQ'1'       RTNF4
  03*C                     CAS            RTN100           .CHECK
    C                     ENDCS                                       ?
    C*  F7 DOWNLOAD*
  04-C           *IN99     IFEQ '0'
    C*          *IN07     ANDEQ'1'
    C*                    SETOF                     88
    C                     CALL 'PUC062C2'
  04-C                     ENDIF
  02-C                     ENDIF
  01-C                     ENDDO
     C*
     C                     EXSR OUTLDA
     C*
     C   03                SETON                     LR
     C                     RETRN
      *===============================================================*
      *          RTN010....INIT SCREEN
      *===============================================================*
01===C           RTN010    BEGSR
|    C*
|    C           *NAMVAR   DEFN *LDA      LDA
|    C                     IN   LDA
|    C*
|    C                     Z-ADD2         $EVR
|    C*
|    C                     MOVE *BLANK    DBG01
|    C                     MOVE *BLANK    D#B03
|    C                     MOVE *BLANK    DBG02
|    C                     MOVE *BLANK    DND04
|    C                     MOVE *BLANK    DBG04S
|    C                     MOVE *BLANK    DBG04E
|    C                     Z-ADD0         DBG03
|    C                     Z-ADD0         DATE
|    C*                    Z-ADD0         DATEE   80
|    C                     MOVEL'SCR001'  APPSCR  6
|    C*
01===C                     ENDSR
      *===============================================================*
      *          RTN100....CHECK SCREEN
      *===============================================================*
02===C           RTN100    BEGSR
|    C**公司別
| 01-C           DBG01     IFEQ *BLANKS
|   C                     SETON                     60  99
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     MOVEL*BLANK    D#B03
| 01-C                     END
|    C   99                GOTO END100
|    C*
|    C           DBG01     CHAINPA#BPF               40
| 02-C           *IN40     IFEQ '0'
|   C                     MOVEL#B03      D#B03
| 02*C                     ELSE
|   C                     SETON                     6099
|   C                     MOVEL*BLANK    D#B03
|   C                     MOVEL'ERR0018' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 02-C                     END
|    C   99                GOTO END100
|    C**通路
| 03-C           DBG02     IFEQ *BLANK
|   C                     MOVEL*BLANK    DND04
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
|   C                     SETON                     6199
| 03-C                     END
|    C   99                GOTO END100
|    C*
|    C           KEYND     CHAINND0                  40
| 04-C           *IN40     IFEQ '0'
|   C                     MOVELND04      DND04
| 04*C                     ELSE
|   C                     SETON                     6199
|   C                     MOVEL*BLANK    DND04
|   C                     MOVEL'ERR0019' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 04-C                     END
|    C   99                GOTO END100
|    C*
|    C**排班月年
| 05-C           DBG03     IFEQ *ZERO
|   C                     SETON                     6299
|   C                     MOVEL'ERR0001' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 05*C                     ELSE
|    C           D03YY     ADD  2000      TEMPD   60
|    C                     MULT 100       TEMPD
|    C                     ADD  D03MM     TEMPD   60
|    C                     CALL 'P39'
|    C                     PARM TEMPD     P3901I  60
|    C                     PARM '1'       P3902I  1
|    C                     PARM '1'       P3903I  1
|    C                     PARM '2'       P3904I  1
|    C                     PARM '1'       P3905I  1
|    C           DATE      PARM           P3901O  60
|    C*
| 05-C                     END
|    C   99                GOTO END100
|    C*
|    C**分店代號
| 10-C           DBG04S    IFEQ *BLANKS
|   C                     MOVE *LOVAL    DBG04S
| 10-C                     END
|    C*
| 11-C           DBG04E    IFEQ *BLANKS
|   C                     MOVE *HIVAL    DBG04E
| 11-C                     END
|    C*
| 12-C           DBG04S    IFGT DBG04E
|   C                     SETON                     636499
|   C                     MOVEL'ERR0005' ERRID
|   C                     MOVEL'SCMF'    ERRF
| 12-C                     END
|    C   99                GOTO END100
|    C*
|    C*                    SETON                     88
|    C*
02===C           END100    ENDSR
      *===============================================================*
      *          RTNF4 ....F4 HELP
      *===============================================================*
03===C           RTNF4     BEGSR
|    C*
|    C*                    SETOF                     88
|    C********************
|    C*  GET ROW,COL     *
|    C********************
|    C           #CSR      DIV  256       D#ROW            *ROW
|    C                     MVR            D#COL            *COL
|    C** 游標位置即為(D#ROW,D#COL)
| 01-C           APPSCR    IFEQ 'SCR001'
|   C*
|   C*分店代號
| 02-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE40
|   C                     CALL 'SWD003'
|   C                     PARM           DBG01
|   C                     PARM           DBG02
|   C                     PARM           DBG04S
|   C                     GOTO ENDF4
| 02-C                     END
|    C*
| 03-C           D#ROW     IFEQ 12
|   C           D#COL     ANDGE44
|   C           D#COL     ANDLE48
|   C                     CALL 'SWD003'
|   C                     PARM           DBG01
|   C                     PARM           DBG02
|   C                     PARM           DBG04E
|   C                     GOTO ENDF4
| 03-C                     END
|    C*
| 06-C           D#ROW     IFEQ 19
|   C           D#COL     ANDGE36
|   C           D#COL     ANDLE37
|   C                     CALL 'WDS011'
|   C           $PRTID    PARM $PRTID    S011O1  20
|   C                     GOTO ENDF4
| 06-C                     END
|    C*
| 01-C                     END
|    C*
03===C           ENDF4     ENDSR
      *===============================================================*
      *          OUTLDA....OUT LDA
      *===============================================================*
04===C           OUTLDA    BEGSR
|    C*
|    C                     OUT  *NAMVAR
|    C*
04===C           ENDLDA    ENDSR
      *===============================================================*
     C/COPY HBP2CVTR
