     A*****************************************************************
     A*          單件運費資料檔(C#EDPF)
     A*****************************************************************
     A                                      REFACCPTH(C#EDPF)
     A          R ED0                       PFILE(C#EDPF)
