     A*****************************************************************
     A*          分店科目對照檔(C#EELF01)  KEY=EE01,EE02,EE04,EE03
     A*****************************************************************
     A          R EE0                       PFILE(C#EEPF)
      *
     A          K EE01
     A**             ('公司別')
     A          K EE02
     A**             ('通路代號')
     A          K EE04
     A**             ('分店代號')
     A          K EE03
     A**             ('會計科目')
