     A*****************************************************************
     A*          通路產品代號對照檔(C#EGPF)
     A*****************************************************************
     A                                      REFACCPTH(C#EGPF)
     A          R EG0                       PFILE(C#EGPF)
