     A*****************************************************************
     A*          通路產品代號對照檔- FOR 西祺
     A*****************************************************************
     A          R EG0                       PFILE(C#EGPF)
      **
     A          K EG01
     A          K EG02
     A          K EG06
     A          K EG04
