     A*****************************************************************
     A*       供應商對照表
     A*****************************************************************
     A                                      UNIQUE
     A          R EX0
      *
     A            EX01           5A         COLHDG('西祺供應商')
     A            EX02           5A         COLHDG('茂世供應商')
      *
     A          K EX01
