     A*****************************************************************
     A*          產品庫存分庫檔
     A*****************************************************************
     A          R TB0                       PFILE(INTBPF)
     A*
     A          K TB01
     A*               公司別
     A          K TB02
     A*               年月
     A          K TB03
     A*               通路代號
     A          K TB05
     A*               產品代號
     A          K TB04
     A*               分店代號
