     A*****************************************************************
     A*          進貨退出明細檔
     A*****************************************************************
     A          R TF0                       PFILE(INTFPF)
     A*
     A          K TF05
     A*               公司
     A          K TF08
     A*               退出日期
     A          S TF09                      COMP(EQ 'P')
