     A*****************************************************************
     A*         陳列轉進貨明細檔(INTHPF)
     A*****************************************************************
     A          R TH0                       PFILE(INTHPF)
     A*
     A          K TH06
     A          K TH07
     A          K TH08
     A          K TH05
     A          K TH02
