     A*****************************************************************
     A*         陳列轉進貨明細檔(INTHPF)
     A*****************************************************************
     A          R TH0                       PFILE(INTHPF)
     A*
     A          K TH06
     A          K TH09
     A          S TH10                      COMP(EQ 'P')
