     A*****************************************************************
     A*          存貨調整主檔
     A*****************************************************************
     A          R TI0                       PFILE(INTIPF)
     A*
     A          K TI01
     A*               公司別
     A          K TI03
     A*               調整日期
     A          K TI05
     A*               單據號碼
     A          S TI07                      COMP(EQ ' ')
