     A*****************************************************************
     A*          陳列品退出主檔
     A*****************************************************************
     A          R TK0                       PFILE(INTKPF)
     A*
     A          K TK01
     A*               公司別
     A          K TK03
     A*               退出日期
     A          K TK05
     A*               單據號碼
     A          S TK07                      COMP(NE 'P')
