     A*****************************************************************
     A*         陳列品退出明細檔(INTLPF)
     A*****************************************************************
     A          R TL0                       PFILE(INTLPF)
     A*
     A          K TL05
     A          K TL06
     A          K TL07
     A          K TL04
     A          K TL02
