     A*****************************************************************
     A*          陳列品資料檔 INTNLF11
     A*****************************************************************
     A          R TN0                       PFILE(INTNPF)
     A*
     A          K TN18
     A*                原單號
     A          K TN05
     A*                產品代號
     A*
