     A*****************************************************************
     A*          陳列品資料檔 INTNLF03
     A*****************************************************************
     A          R TN0                       PFILE(INTNPF)
     A*
     A          K TN09
     A*                驗收單號
     A          K TN05
     A*                產品代號
     A          K TNVV
     A*                建檔日期
