     A*****************************************************************
     A*          陳列品資料檔
     A*****************************************************************
     A          R TN0                       PFILE(INTNPF)
     A*
     A          K TN01
     A          K TN05
