     A*****************************************************************
     A*          æP∞‚≥Ø¶C≠…≥f≤ß∞ ¿…  FOR¶Ë∏R
     A*****************************************************************
     A          R TP0                       PFILE(INTPPF)
      **
     A          K TP11
