     A*****************************************************************
     A*          貨運站資料檔(MANAPF)     KEY=NA01
     A*****************************************************************
     A                                      REFACCPTH(MANAPF)
     A          R NA0                       PFILE(MANAPF)
