     A*****************************************************************
     A*          供應商基本資料視窗查詢工作檔
     A*****************************************************************
     A          R WNB0
     A            WNB01          5          COLHDG('供應商代號')
     A            WNB02         42          COLHDG('供應商全稱')
     A            WNB03         12          COLHDG('供應商簡稱')
     A*
     A          K WNB01
