     A*****************************************************************
     A*          供應商基本資料檔(MANBPF)  KEY=NB01
     A*****************************************************************
     A                                      REFACCPTH(MANBPF)
     A          R NB0                       PFILE(MANBPF)
