     A*****************************************************************
     A*          供應商基本資料檔- FOR西祺
     A*****************************************************************
     A          R NB0                       PFILE(MANBPF)
      **
     A          K NB15
     A**             ('貨運區碼')
     A          K NB01
     A**             ('供應商代號')
