     A*****************************************************************
     A*          產品基本資料檔- FOR 西祺
     A*****************************************************************
     A          R NC0                       PFILE(MANCPF)
      **
     A          K NC03
     A**             ('供應商代號')
     A          K NC01
     A**             ('公司別')
     A          K NC02
     A**             ('產品代碼')
