     A*****************************************************************
     A*          產品基本資料檔- FOR 西祺
     A*****************************************************************
     A          R NC0                       PFILE(MANCPF)
     A**
     A          K NC02
     A**             ('產品代碼')
