     A*****************************************************************
     A*      通路分店基本資料檔(MANEPF)
     A*****************************************************************
     A                                      REFACCPTH(MANEPF)
     A          R NE0                       PFILE(MANEPF)
