     A*****************************************************************
     A*          通路分店基本資料檔- FOR西祺
     A*****************************************************************
     A          R NE0                       PFILE(MANEPF)
      **
     A          K NE03
     A**             ('分店代號')
     A          K NE02
     A**             ('通路代號')
