     A*****************************************************************
     A*          產品基本資料檔           KEY=NI01+NI02+NI03
     A*****************************************************************
     A                                      REFACCPTH(MANIPF)
     A          R NI0                       PFILE(MANIPF)
