     A*****************************************************************
     A*          訂貨單明細檔- FOR 西祺
     A*****************************************************************
     A          R CE0                       PFILE(POCEPF)
      **
     A          K CE01
     A**             ('訂貨單號')
     A          K CE03
     A**             ('產品代號')
