     A*****************************************************************
     A*          採購單主檔- FOR 西祺
     A*****************************************************************
     A          R CH0                       PFILE(POCHPF)
      **
     A          K CH01
     A**             ('公司別')
     A          K CH02
     A**             ('通路代號')
     A          K CH03
     A**             ('採購單日期')
     A          S CH13                      COMP(EQ ' ')
     A**             ('狀態碼空白：未寄出')
