     A*****************************************************************
     A*          驗收單主檔- FOR 西祺
     A*****************************************************************
     A          R CL0                       PFILE(POCLPF)
      **
     A          K CL01
     A**             ('公司別')
     A          K CL07
     A**             ('到貨運日期')
     A          K CL05
     A**             ('驗收單號')
     A          S CL14                      COMP(NE 'P')
