     A*****************************************************************
     A*    前台暫停作業控制工作檔(SCWB99PF)
     A*****************************************************************
     A          R WB99
     A            WB9901         1A         COLHDG('控制碼')
