     A*****************************************************************
     A*          通路銷售資料檔(SEHALF)
     A*****************************************************************
     A          R HA0                       PFILE(SEHAPF)
     A*
     A          K HA01
     A*                公司別
     A          K HA03
     A*                銷售日期
     A          S HA10                      COMP(EQ 'P')
     A*
