     A*****************************************************************
     A*       ¥f±d∞≤§È©w∏q¿…(UTL6PF)   KEY=L601+L602
     A*****************************************************************
     A          R L60                       PFILE(UTL6PF)
      *
     A          K L601
     A          K L602
     A          K L604                      DESCEND
     A          K L603
