     A*****************************************************************
     A*          貨架與產品對照檔- FOR西祺KEY= EB01+EB02+EB04+EB03
     A*****************************************************************
     A          R EB0                       PFILE(C#EBPF)
     A**
     A          K EB01
     A**             ('公司別')
     A          K EB02
     A**             ('通路代號')
     A          K EB04
     A**             ('產品代號')
     A          K EB03
     A**             ('貨架代號')
