     A*****************************************************************
     A*          銷售區碼與分店對照檔(C#ECPF)
     A*****************************************************************
     A                                      REFACCPTH(C#ECPF)
     A          R EC0                       PFILE(C#ECPF)
