     A*****************************************************************
     A*          分店科目對照檔(C#EEPF)
     A*****************************************************************
     A                                      REFACCPTH(C#EEPF)
     A          R EE0                       PFILE(C#EEPF)
