     A*****************************************************************
     A*          通路分店代號對照檔(C#EFPF)
     A*****************************************************************
     A                                      REFACCPTH(C#EFPF)
     A          R EF0                       PFILE(C#EFPF)
