     A*****************************************************************
     A*          通路分店代號對照檔- FOR 西祺
     A*****************************************************************
     A          R EF0                       PFILE(C#EFPF)
      **
     A          K EF01
     A          K EF02
     A          K EF04
     A**             ('分店代號')
