     A*****************************************************************
     A*          通路產品代號對照檔- FOR 西祺
     A*****************************************************************
     A          R EG0                       PFILE(C#EGPF)
      **
     A          K EG04
     A**             ('產品代號')
