     A*****************************************************************
     A*          最低運費資料檔(C#EIPF)
     A*****************************************************************
     A                                      REFACCPTH(C#EIPF)
     A          R EI0                       PFILE(C#EIPF)
