     A*
     A          R ER0
     A            ER01           2          COLHDG('公司')
     A            ER02          10          COLHDG('傳票號碼')
     A            ER03           3  0       COLHDG('傳票號碼')
     A            ER04           8          COLHDG('會計科目')
     A            ER05          11  2       COLHDG('借方金額')
     A            ER06          11  2       COLHDG('貸方金額')
