     A*****************************************************************
     A*          產品庫存分庫檔
     A*****************************************************************
     A          R TA0                       PFILE(INTAPF)
     A*
     A          K TA01
     A*               公司別
     A          K TA03
     A*               產品編號
     A          K TA02
     A*               年月
