     A*****************************************************************
     A*          存貨調撥明細檔
     A*****************************************************************
     A          R TD0                       PFILE(INTDPF)
     A*
     A          K TD05
     A*               公司別
     A          K TD09
     A*               調出日期
     A          S TD11                      COMP(NE 'P')
     A            TD12                      COMP(EQ 'T')
