     A*****************************************************************
     A*          進貨退出主檔
     A*****************************************************************
     A          R TE0                       PFILE(INTEPF)
     A*
     A          K TE01
     A*               公司別
     A          K TE03
     A*               退出日期
     A          K TE05
     A*               單據號碼
     A          S TE06                      COMP(EQ ' ')
