     A*****************************************************************
     A*          進貨退出明細檔
     A*****************************************************************
     A          R TF0                       PFILE(INTFPF)
     A*
     A          K TF01
     A*               單據號碼
     A          K TF02
     A*               供應商
