     A*****************************************************************
     A*          陳列轉進貨主檔
     A*****************************************************************
     A          R TG0                       PFILE(INTGPF)
     A*
     A          K TG01
     A*               公司別
     A          K TG03
     A*               轉進日期
     A          K TG05
     A*               單據號碼
     A          S TG07                      COMP(EQ ' ')
