     A*****************************************************************
     A*         陳列品退出明細檔(INTLPF)
     A*****************************************************************
     A          R TL0                       PFILE(INTLPF)
     A*
     A          K TL05
     A          K TL08
     A          S TL09                      COMP(EQ 'P')
