     A*****************************************************************
     A*          產品成本調整資料檔
     A*****************************************************************
     A          R TM0                       PFILE(INTMPF)
     A*
     A          K TM01
     A*               公司別
     A          K TM03
     A*               產品代號
     A          K TM02
     A*               調整日期
     A          S TM07                      COMP(EQ 'P')
