     A*****************************************************************
     A*          陳列品資料檔 INTNLF06
     A*****************************************************************
     A          R TN0                       PFILE(INTNPF)
     A*
     A          K TN09
     A*                單號
     A          K TN05
     A*                產品代號
     A          K TN04
     A*                分店代號
     A*
