     A*****************************************************************
     A*          陳列品資料檔 INTNLF05
     A*****************************************************************
     A          R TN0                       PFILE(INTNPF)
     A*
     A          K TN10
     A*                採購單號
     A          K TN05
     A*                產品代號
