     A*****************************************************************
     A*          陳列品資料檔 (INTNPF) KEY= TN01-TN05 (產品非唯一)
     A*****************************************************************
     A                                      REFACCPTH(INTNPF)
     A          R TN0                       PFILE(INTNPF)
