     A*****************************************************************
     A*          æP∞‚≥Ø¶C≠…≥f≤ß∞ ¿…  FOR¶Ë∏R
     A*****************************************************************
     A          R TP0                       PFILE(INTPPF)
      **
     A          K TP01
     A          K TP02
     A          K TP04
     A          K TP12
     A          K TP05
