     A*****************************************************************
     A*          銷售陳列借貨異動檔  FOR西祺
     A*****************************************************************
     A          R TP0                       PFILE(INTPPF)
      **
     A          K TP01
     A*                公司
     A          K TP03
     A*                銷售日期
