     A*****************************************************************
     A*          æP∞‚µLÆw¶s≤ß∞ ¿…
     A*****************************************************************
     A          R TQ0                       PFILE(INTQPF)
      **
     A          K TQ11
     A          K TQ05
     A          K TQ04
