     A*****************************************************************
     A*          銷售無庫存異動檔
     A*****************************************************************
     A          R TQ0                       PFILE(INTQPF)
      **
     A          K TQ01
     A*                公司
     A          K TQ03
     A*                銷售日期
