     A*****************************************************************
     A*          æP∞‚µLÆw¶s≤ß∞ ¿…
     A*****************************************************************
     A          R TQ0                       PFILE(INTQPF)
      **
     A          K TQ01
     A          K TQ02
     A          K TQ04
     A          K TQ05
