     A*****************************************************************
     A*         TRX FILE    (INTXPF)
     A*****************************************************************
     A          R TX0                       PFILE(INTXPF)
     A*
     A          K TX01
     A*                公司
     A          K TX06
     A*                單據日期
