     A*****************************************************************
     A*          產品基本資料檔           KEY=NC01+NC02
     A*****************************************************************
     A                                      REFACCPTH(MANCPF)
     A          R NC0                       PFILE(MANCPF)
