     A*****************************************************************
     A*          通路商基本資料檔(MANDPF) KEY=ND01+ND02
     A*****************************************************************
     A                                      REFACCPTH(MANDPF)
     A          R ND0                       PFILE(MANDPF)
