     A*****************************************************************
     A*        前台人員資料檔(MANFPF)
     A*****************************************************************
     A                                      REFACCPTH(MANFPF)
     A          R NF0                       PFILE(MANFPF)
