     A*****************************************************************
     A*          ¾P°â°Ï½X¸ê®ÆÀÉ(MANGPF)   KEY=NG01
     A*****************************************************************
     A                                      REFACCPTH(MANGPF)
     A          R NG0                       PFILE(MANGPF)
