     A*****************************************************************
     A*          ¾P°â°Ï½X¸ê®ÆÀÉ
     A*****************************************************************
     A          R NG0                       PFILE(MANGPF)
     A*
     A          K NG05
