     A*****************************************************************
     A*          分店產品資料檔(MANHLF01)  KEY=NH01+NH02+NH04+NH03
     A*****************************************************************
     A          R NH0                       PFILE(MANHPF)
     A**
     A          K NH01
     A**             ('公司別')
     A          K NH02
     A**             ('通路代號')
     A          K NH04
     A**             ('產品代號')
     A          K NH03
     A**             ('分店代號')
