     A*****************************************************************
     A*          供應商產品報價單主檔- FOR 西祺
     A*****************************************************************
     A          R CA0                       PFILE(POCAPF)
     A**
     A          K CA04
     A**             ('報價單號')
