     A*****************************************************************
     A*          供應商產品報價單明細檔 - FOR 西祺
     A*****************************************************************
     A          R CB0                       PFILE(POCBPF)
     A**
     A          K CB02
     A*              ('產品代號')
