     A*****************************************************************
     A*          供應商產品報價檔- FOR 西祺
     A*****************************************************************
     A          R CC0                       PFILE(POCCPF)
      **
     A          K CC04
     A**             ('產品代號')
     A          K CC07                      DESCEND
     A**             ('生效起日')
