     A*****************************************************************
     A*          供應商出貨箱數檔- FOR 西祺
     A*****************************************************************
     A          R CK0                       PFILE(POCKPF)
      **
     A          K CK07
     A**             ('供商貨運區碼')
     A          K CK09
     A**             ('分店貨運區碼')
