     A*****************************************************************
     A*          驗收單明細檔- FOR 西祺
     A*****************************************************************
     A          R CM0                       PFILE(POCMPF)
      **
     A          K CM01
     A**             ('驗收單號')
     A          K CM03
     A**             ('產品代號')
