     A*****************************************************************
     A*WB00 2019/07/26 DEREK WEB改版                                *
     A*WB01 2020/12/11 CAROL分店產品資料檔調整                      *
     A*****************************************************************
     A*       公用檔案: UTL__                                         *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |UTL1PF|代碼定義碼                |L101                |
     A*  02  |UTL2PF|代碼值設定檔              |L201+L202           |
     A*  03  |UTL3PF|單別資料檔                |L301+L302           |
     A*  04  |UTL4PF|休假日定義檔              |L401(D)             |
     A*****************************************************************
     A*       主檔資料: MAN___                                      *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |MANAPF|貨運站資料檔              |NA01                |
     A*  02  |MANBPF|供應商基本資料檔          |NB01                |
     A*  03  |MANCPF|產品基本資料檔            |NC01+NC02           |
     A*  04  |MANDPF|銷售通路基本資料檔        |ND01+ND02           |
     A*  05  |MANEPF|銷售通路分店資料檔        |NE01-NE03           |
     A*  06  |MANFPF|前台人員資料檔            |NF01                |
     A*  07  |MANGPF|銷售區碼資料檔            |NG01                |
WB00+A*  08  |MANHPF|分店產品資料檔            |NH01-NH04           |
     A*****************************************************************
     A*       參數/對照檔: C#E__                                  *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |C#EAPF|等級與貨架對照檔          |EA01-EA05           |
     A*  02  |C#EBPF|貨架與產品對照檔          |EB01-EB05           |
     A*  03  |C#ECPF|銷售區碼與分店對照檔      |EC01-EC05           |
     A*  04  |C#EDPF|單件運費資料檔            |ED01-ED03           |
     A*  05  |C#EEPF|分店會計科目對照檔        |EE01-EE04           |
     A*  06  |C#EFPF|通路分店代號對照檔        |EF01-EF03           |
     A*  07  |C#EGPF|通路產品代號對照檔        |EG01-EG04           |
     A*  08  |C#EHPF|庫存月結參數檔            |EH01                |
     A*  09  |C#EIPF|最低運費資料檔            |EI01-EI03           |
     A*  10  |C#EJPF|運費月結參數檔            |EJ01                |
W300+A*  11  |C#ELPF|廠商&通路產品代號對照檔 |EL01-EL04           |
     A*****************************************************************
     A*      流水號檔: S@F__                                        *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |S@FAPF|主要單據流水號檔          |FA01-FA04           |
     A*  02  |S@FBPF|供應商產品報價單流水號檔  |FB01-FB03           |
     A*  03  |S@FCPF|採購批次流水號檔          |FC01-FC03           |
     A*****************************************************************
     A*      單號介面控制檔: P@JA__                                   *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |P@JAPF|傳票介面控制檔            |JA01                |
     A*****************************************************************
     A*      採購資料: POC___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |POCAPF|供應商產品報價單主檔      |CA01-CA07           |
     A*  02  |POCBPF|供應商產品報價單明細檔    |CB01+CB02           |
     A*  03  |POCCPF|供應商產品報價檔          |CC01-CC07           |
     A*  04  |POCDPF|訂貨單主檔                |CD05                |
     A*  05  |POCEPF|訂貨單明細檔              |CE01-CE03           |
     A*  06  |POCFPF|訂貨單客戶資料檔          |CF01                |
     A*  07  |POCGPF|訂貨單供應商備註檔        |CG01+CG02           |
     A*  08  |POCHPF|採購單主檔                |CH04                |
     A*  09  |POCIPF|採購單明細檔              |CI01-CI03           |
     A*  10  |POCJPF|採購單客戶資料檔          |CJ01                |
     A*  11  |POCKPF|供應商出貨箱數檔 |CK01-CK03+CK05+CK08+CK06+CK10|
     A*  12  |POCLPF|驗收單主檔                |CL05                |
     A*  13  |POCMPF|驗收單明細檔              |CM01-CM03           |
     A*  14  |POCNPF|驗收單客戶資料檔          |CN01                |
     A*  15  |POCOPF|驗收單供應商備註檔        |CO01+CO02           |
     A*****************************************************************
     A*      庫存資料: INT___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |INTAPF|產品庫存總庫檔            |TA01-TA03           |
     A*  02  |INTBPF|產品庫存分庫檔            |TB01-TB05           |
     A*  03  |INTCPF|存貨調撥主檔              |TC05                |
     A*  04  |INTDPF|存貨調撥明細檔            |TD01+TD02           |
     A*  05  |INTEPF|進貨退出主檔              |TE05                |
     A*  06  |INTFPF|進貨退出明細檔            |TF01-TF02           |
     A*  07  |INTGPF|陳列轉進貨主檔            |TG05                |
     A*  08  |INTHPF|陳列轉進貨明細檔          |TH01-TH02           |
     A*  09  |INTIPF|存貨調整主檔              |TI05                |
     A*  10  |INTJPF|存貨調整明細檔            |TJ01-TJ02           |
     A*  11  |INTKPF|陳列品退貨主檔            |TG05                |
     A*  12  |INTLPF|陳列品退貨明細檔          |TH01-TH02           |
     A*  13  |INTMPF|產品成本調整資料檔        |TM08                |
     A*  14  |INTNPF|陳列品資料檔              |TN01-TN05+TN09      |
     A*  14  |INTNWF|陳列品資料工作檔          |TNW01-TNW09         |
     A*  15  |INTOLF|庫存異動明細檔(請參考獨立檔案)               |
     A*  16  |INTPPF|銷售陳借異動檔            |TP01-TP05           |
     A*  16  |INTPWF|銷售陳借工作檔            |TPW01-TPW03         |
     A*  17  |INTQPF|銷售無庫異動檔            |TQ01-TQ05           |
WB00+A*  18  |INTSPF|缺貨產品資料檔            |TR01-TR03           |
     A*****************************************************************
     A*      銷售資料: SEH___                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |SEHAPF|通路銷售資料檔            | HA01-HA05          |
     A*****************************************************************
     A*       VIP資料: VP____                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |VPAAPF| VIP資料檔                | AA01+AA02          |
     A*  02  |VSDAPF| VIP銷售資料檔            | SD01-SD06          |
     A*****************************************************************
     A*      盤點資料: PI____                                       *
     A*================================================================
     A*序號|代號|      檔　案　名　稱      |  索　引　欄　位  |
     A*======|======|============================|====================|
     A*  01  |PIAAPF| 每月盤點主檔             | AA01+AA02          |
     A*  02  |PIABPF| 每月盤點明細檔           | AB01+AB02          |
     A*****************************************************************
     A          R SCRFR
     A*****************************************************************
     A*          代碼定義碼(UTL1PF)        KEY=L101
     A*****************************************************************
     A            L101           8          COLHDG('代碼欄位')
     A            L102          22O         COLHDG('代碼簡稱')
     A            L103          32O         COLHDG('代碼名稱－維護')
     A            L104          32O         COLHDG('代碼名稱－列印')
     A            L105           3  0       COLHDG('代碼長度')
     A            L106           3  0       COLHDG('代碼說明長度')
     A            L107           1          COLHDG('可維護否')
     A                                      VALUES('Y' 'N')
     A*                                     'Y'-可自行維護
     A*                                     'N'-固定代碼不可自行維護
     A*****************************************************************
     A*          代碼值設定檔(UTL2PF)      KEY=L201+L202
     A*****************************************************************
     A            L201      R               COLHDG('代碼欄位')
     A                                      REFFLD(L101)
     A            L202          10          COLHDG('代碼內容')
     A            L203          32O         COLHDG('代碼說明')
     A            L2VV           8S 0       COLHDG('建檔日期')
     A            L2WW          10          COLHDG('異動程式')
     A            L2XX           8S 0       COLHDG('異動日期')
     A            L2YY           6S 0       COLHDG('異動時間')
     A            L2ZZ          10          COLHDG('異動者　')
     A*****************************************************************
     A*          單別資料檔(UTL3PF)        KEY=L301+L302
     A*****************************************************************
     A            L301           1          COLHDG('單別類型')
     A            L302           2          COLHDG('單別')
     A            L303          22O         COLHDG('單別說明')
     A*****************************************************************
     A*          休假日定義檔(UTL4PF)        KEY=L401
     A*****************************************************************
     A            L401           6S 0       COLHDG('年月份')
     A            L402          31          COLHDG('內容')
     A            L4VV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            L4WW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            L4XX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            L4YY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            L4ZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          貨運站資料檔(MANAPF)   KEY=NA01
     A*****************************************************************
     A            NA01           1          COLHDG('貨運站區碼')
     A            NA02          48O         COLHDG('貨運站全稱')
     A            NA03          12O         COLHDG('貨運站簡稱')
     A            NA04          32O         COLHDG('地址１')
     A            NA05          32O         COLHDG('地址２')
     A            NA06          12O         COLHDG('聯絡人')
     A            NA07          15          COLHDG('電話１')
     A            NA08          15          COLHDG('電話２')
     A            NA09          15          COLHDG('傳真機')
     A            NA10          40          COLHDG('電子信箱')
     A            NA11           8S 0       COLHDG('有效起日')
     A            NA12           8S 0       COLHDG('有效訖日')
     A            NA13          32O         COLHDG('備註１')
     A            NA14          32O         COLHDG('備註２')
     A            NAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          供應商基本資料檔(MANBPF)  KEY=NB01
     A*****************************************************************
     A            NB01           5          COLHDG('供應商代號')
     A            NB02          42O         COLHDG('供應商全稱')
     A            NB03          12O         COLHDG('供應商簡稱')
     A            NB04           7          COLHDG('郵遞區號')
     A            NB05          32O         COLHDG('地址１')
     A            NB06          32O         COLHDG('地址２')
     A            NB07           8          COLHDG('統一編號')
     A            NB08          22O         COLHDG('負責人')
     A            NB09          22O         COLHDG('聯絡人')
     A            NB10          15          COLHDG('電話１')
     A            NB11          15          COLHDG('電話２')
     A            NB12          15          COLHDG('傳真機')
     A            NB13          40          COLHDG('電子信箱')
     A            NB14           2          COLHDG('付款方式')
     A            NB15      R               COLHDG('貨運區碼')
     A                                      REFFLD(NA01)
     A            NB16           1          COLHDG('國內外別')
     A*                                     '1' -國內
     A*                                     '2' -國外
     A            NB17          32O         COLHDG('備註１')
     A            NB18          32O         COLHDG('備註２')
     A            NBVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NBWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NBXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NBYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          產品基本資料檔(MANCPF)   KEY=NC01+NC02
     A*****************************************************************
     A            NC01      R               COLHDG('公司別')
     A                                      REFFLD(#B01 *LIBL/PA#BPF)
     A            NC02           9          COLHDG('產品代號')
     A            NC03      R               COLHDG('供應商')
     A                                      REFFLD(NB01)
     A            NC04          60O         COLHDG('中文全稱')
     A            NC05          18O         COLHDG('中文簡稱')
     A            NC06          30          COLHDG('英文全稱１')
     A            NC07          30          COLHDG('英文全稱２')
     A            NC08          15          COLHDG('英文簡稱')
     A            NC09           2          COLHDG('產品歸屬')
     A            NC10           1          COLHDG('產品識別')
     A            NC11           2          COLHDG('產品種類')
     A            NC12           2          COLHDG('產品品牌')
     A            NC13           2          COLHDG('產品等級')
     A            NC14           4O         COLHDG('採購單位')
     A            NC15           1          COLHDG('單位容量')
     A            NC16           3S 0       COLHDG('單位轉換')
     A            NC17           2S 0       COLHDG('包裝單位數')
     A            NC18           2          COLHDG('原產地')
     A            NC19           7P 0       COLHDG('零售價')
     A            NC20          13          COLHDG('國際條碼')
     A            NC21           6O         COLHDG('計量單位')
     A            NC22           4S 1       COLHDG('每瓶長度')
     A            NC23           4S 1       COLHDG('每瓶寬度')
     A            NC24           4S 1       COLHDG('每瓶高度')
     A            NC25           1          COLHDG('狀態碼')
     A            NC26          32O         COLHDG('備註１')
     A            NC27          32O         COLHDG('備註２')
     A            NC28          32          COLHDG('預留備用')
     A            NCVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NCWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NCXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NCYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NCZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          銷售通路基本資料檔(MANDPF) KEY=ND01+ND02
     A*****************************************************************
     A            ND01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            ND02           2          COLHDG('通路代號')
     A            ND03          48O         COLHDG('通路全稱')
     A            ND04          10O         COLHDG('通路簡稱')
     A            ND05          32O         COLHDG('通路地址１')
     A            ND06          32O         COLHDG('通路地址２')
     A            ND07           5          COLHDG('郵遞區號')
     A            ND08          12O         COLHDG('負責人')
     A            ND09          12O         COLHDG('聯絡人')
     A            ND10          12O         COLHDG('收貨人')
     A            ND11          15          COLHDG('電話１')
     A            ND12          15          COLHDG('電話２')
     A            ND13          15          COLHDG('傳真機')
     A            ND14          40          COLHDG('電子信箱')
     A            ND15           8          COLHDG('統一編號')
     A            ND16           1          COLHDG('通路類別')
     A*                                     '1'-大賣場
     A*                                     '2'-客戶
     A*                                     '3'-員工
     A            ND17           1          COLHDG('銷售型態')
     A*                                     '1'-寄賣
     A*                                     '2'-銷售
     A            ND18           3S 0       COLHDG('收款日')
     A            ND19           2S 0       COLHDG('結算日')
     A            ND20          32O         COLHDG('備註１')
     A            ND21          32O         COLHDG('備註２')
     A            ND22           1A         COLHDG('銷售確認')
     A            ND23           1A         COLHDG('往來狀態')
     A*                                     'A'-ACTIVE
     A*                                     'I'-INACTIVE
     A            ND24         100A         COLHDG('備用欄位')
     A            NDVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NDWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NDXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NDYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          銷售通路分店資料檔(MANEPF) KEY=NE01-NE03
     A*****************************************************************
     A            NE01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            NE02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            NE03           5          COLHDG('分店代號')
     A            NE04          48O         COLHDG('分店全稱')
     A            NE05          10O         COLHDG('分店簡稱')
     A            NE06          32O         COLHDG('分店地址１')
     A            NE07          32O         COLHDG('分店地址２')
     A            NE08          12O         COLHDG('聯絡人')
     A            NE09          12O         COLHDG('收貨人')
     A            NE10          15          COLHDG('電話１')
     A            NE11          15          COLHDG('電話２')
     A            NE12          15          COLHDG('傳真機')
     A            NE13          40          COLHDG('電子信箱')
     A            NE14           2          COLHDG('分店等級')
     A            NE15      R               COLHDG('貨運區碼')
     A                                      REFFLD(NA01)
     A            NE16           1          COLHDG('往來狀態')
     A*                                     'A'-ACTIVE
     A*                                     'I'-INACTIVE
     A            NE17           5          COLHDG('郵遞區號')
     A            NE18          32O         COLHDG('備註１')
     A            NE19          32O         COLHDG('備註２')
WB00+A            NE20           1          COLHDG('所有產品')
WB00+A*                                     'Y'-販賣所有產品
WB00+A*                                     'N'-販賣部分產品
     A            NEVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NEWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NEXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NEYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          前台人員資料檔(MANFPF)    KEY=NF01
     A*****************************************************************
     A            NF01          10          COLHDG('人員代號')
     A            NF02           1          COLHDG('職級')
     A*                                     '1'駐店人員
     A*                                     '2'區長
     A            NF03          10O         COLHDG('姓名')
     A            NF04          10          COLHDG('密碼')
     A            NF05           8S 0       COLHDG('有效起日')
     A            NF06           8S 0       COLHDG('有效訖日')
     A            NF07           1          COLHDG('狀態碼')
     A            NF08           1          COLHDG('登錄狀態')
     A            NFVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NFWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NFXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NFYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          銷售區碼資料檔(MANGPF)    KEY=NG01+NG02+NG03
     A*****************************************************************
     A            NG01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            NG02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            NG03           2          COLHDG('銷售區碼')
     A            NG04          10O         COLHDG('區碼名稱')
     A            NG05      R               COLHDG('區長代號')
     A                                      REFFLD(NF01)
     A            NGVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            NGWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            NGXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            NGYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            NGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
WB00+A*****************************************************************
WB00+A*          分店產品資料檔(MANHPF)    KEY=NH01+NH02+NH03+NH04
WB00+A*****************************************************************
WB00+A            NH01      R               COLHDG('公司別')
WB00+A                                      REFFLD(NC01)
WB00+A            NH02      R               COLHDG('通路代號')
WB00+A                                      REFFLD(ND02)
WB00+A            NH03      R               COLHDG('分店代號')
WB00+A                                      REFFLD(NE03)
WB00+A            NH04      R               COLHDG('產品代號')
WB00+A                                      REFFLD(NC02)
WB00+A            NH05           8S 0       COLHDG('暫停供貨日')
WB00+A            NHVV      R               COLHDG('建檔日期')
WB00+A                                      REFFLD(L2VV)
WB00+A            NHWW      R               COLHDG('異動程式')
WB00+A                                      REFFLD(L2WW)
WB00+A            NHXX      R               COLHDG('異動日期')
WB00+A                                      REFFLD(L2XX)
WB00+A            NHYY      R               COLHDG('異動時間')
WB00+A                                      REFFLD(L2YY)
WB00+A            NHZZ      R               COLHDG('異動者　')
WB00+A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          等級與貨架對照檔(C#EAPF)  KEY=EA01-EA04
     A*****************************************************************
     A            EA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EA02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            EA03           2          COLHDG('分店等級')
     A            EA04           4          COLHDG('貨架代號')
     A            EA05           8S 0       COLHDG('有效起日')
     A            EA06           8S 0       COLHDG('有效訖日')
     A            EAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          貨架與產品對照檔(C#EBPF)  KEY=EB01-EB04
     A*****************************************************************
     A            EB01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EB02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            EB03      R               COLHDG('貨架代號')
     A                                      REFFLD(EA04)
     A            EB04      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            EB05           8S 0       COLHDG('有效起日')
     A            EB06           8S 0       COLHDG('有效訖日')
     A            EBVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EBWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EBXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EBYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          銷售區碼與分店對照檔(C#ECPF) KEY=EC01-EC05
     A*****************************************************************
     A            EC01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EC02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            EC03           2          COLHDG('銷售區碼')
     A            EC04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            EC05      R               COLHDG('前台人員代號')
     A                                      REFFLD(NF01)
     A            ECVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            ECWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            ECXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            ECYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            ECZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          單件運費資料檔(C#EDPF)     KEY=ED01-ED03
     A*****************************************************************
     A            ED01      R               COLHDG('出貨區碼')
     A                                      REFFLD(NA01)
     A            ED02      R               COLHDG('到貨區碼')
     A                                      REFFLD(NA01)
     A            ED03           8S 0       COLHDG('生效日期')
     A            ED04           4S 0       COLHDG('單件運費')
     A            EDVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EDWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EDXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EDYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          分店科目對照檔(C#EEPF)    KEY=EE01-EE04
     A*****************************************************************
     A            EE01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EE02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            EE03           6A         COLHDG('會計科目')
     A            EE04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            EE05           2A         COLHDG('科目序號')
     A            EEVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EEWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EEXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EEYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          通路分店代號對照檔(C#EFPF) KEY=EF01-EF03
     A*****************************************************************
     A            EF01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EF02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            EF03           5          COLHDG('通路分店代號')
     A            EF04      R               COLHDG('公司分店代號')
     A                                      REFFLD(NE03)
     A            EFVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EFWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EFXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EFYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          通路產品代號對照檔(C#EGPF) KEY=EG01-EG04
     A*****************************************************************
     A            EG01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EG02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            EG03      R               COLHDG('公司產品代號')
     A                                      REFFLD(NC02)
     A            EG04           8S 0       COLHDG('有效起日')
     A            EG05           8S 0       COLHDG('有效訖日')
     A            EG06          13          COLHDG('通路產品代號')
     A            EGVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EGWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EGXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EGYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          庫存月結參數檔(C#EHPF)  KEY=EH01
     A*****************************************************************
     A            EH01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EH02           6S 0       COLHDG('庫存月結年月')
     A            EH03           1A         COLHDG('參數１')
     A            EH04           1A         COLHDG('參數２')
     A            EH05           1A         COLHDG('參數３')
     A            EH06         100A         COLHDG('預留備用')
     A            EH07           8S 0       COLHDG('帳務區間起日')
     A            EH08           8S 0       COLHDG('帳務區間訖日')
     A            EHVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EHWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EHXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EHYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EHZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          最低運費資料檔(C#EIPF)     KEY=EI01-EI03
     A*****************************************************************
     A            EI01      R               COLHDG('出貨區碼')
     A                                      REFFLD(NA01)
     A            EI02      R               COLHDG('到貨區碼')
     A                                      REFFLD(NA01)
     A            EI03           8S 0       COLHDG('生效日期')
     A            EI04           4S 0       COLHDG('最低運費')
     A            EIVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EIWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EIXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EIYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          運費月結參數檔(C#EJPF)  KEY=EJ01
     A*****************************************************************
     A            EJ01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            EJ02           6S 0       COLHDG('運費月結年月')
     A            EJ03           1A         COLHDG('參數１')
     A            EJ04           1A         COLHDG('參數２')
     A            EJ05           1A         COLHDG('參數３')
     A            EJ06         100A         COLHDG('預留備用')
     A            EJ07           8S 0       COLHDG('貨運區間起日')
     A            EJ08           8S 0       COLHDG('貨運區間訖日')
     A            EJVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            EJWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            EJXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            EJYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            EJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          主要單據流水號檔(S@FAPF) KEY=FA01-FA03
     A*****************************************************************
     A            FA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            FA02      R               COLHDG('單別')
     A                                      REFFLD(L302)
     A            FA03           6S 0       COLHDG('西元日期YYMMDD')
     A            FA04           3S 0       COLHDG('序號')
     A*****************************************************************
     A*          供應商產品報價單流水號檔(S@FBPF) KEY=FB01-FB03
     A*****************************************************************
     A            FB01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            FB02           4S 0       COLHDG('年度')
     A            FB03           2          COLHDG('單別')
     A*                                     'Q1'-年度報價
     A*                                     'Q2'-活動特價
     A            FB04           3S 0       COLHDG('序號')
     A*****************************************************************
     A*          採購批次流水號檔(S@FCPF) KEY=FC01-FC03
     A*****************************************************************
     A            FC01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            FC02      R               COLHDG('通路別')
     A                                      REFFLD(ND02)
     A            FC03           6S 0       COLHDG('西元日期YYMMDD')
     A            FC04           2S 0       COLHDG('序號')
     A*****************************************************************
     A*          傳票介面控制檔(P@JAPF) KEY=JA01
     A*****************************************************************
     A            JA01          13          COLHDG('進銷存收單號')
     A            JA02      R               COLHDG('確認日期')
     A                                      REFFLD(L2XX)
     A            JAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            JAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            JAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            JAZZ      R               COLHDG('異動者')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          供應商產品報價單主檔(POCAPF) KEY=CA01-CA07
     A*****************************************************************
     A            CA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CA02      R               COLHDG('通路別')
     A                                      REFFLD(ND02)
     A            CA03      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CA04          11          COLHDG('報價單號')
     A            CA05           4S 0       COLHDG('年度')
     A            CA06      R               COLHDG('單別')
     A                                      REFFLD(FB03)
     A*                                     'Q1'-年度報價
     A*                                     'Q2'-活動特價
     A            CA07           8S 0       COLHDG('生效起日')
     A            CA08           8S 0       COLHDG('生效訖日')
     A            CA09           1          COLHDG('狀態碼')
     A*                                     ' '-維護
     A*                                     'A'-核準
     A            CA10          40          COLHDG('備註')
     A            CAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          供應商產品報價單明細檔(POCBPF) KEY=CB01-CB02
     A*****************************************************************
     A            CB01      R               COLHDG('報價單號')
     A                                      REFFLD(CA04)
     A            CB02      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            CB03           8S 2       COLHDG('單價')
     A            CBVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CBWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CBXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CBYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          供應商產品報價檔(POCCPF)  KEY=CC01-CC07
     A*****************************************************************
     A            CC01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CC02      R               COLHDG('通路別')
     A                                      REFFLD(ND02)
     A            CC03      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CC04      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            CC05           4S 0       COLHDG('年度')
     A            CC06           1          COLHDG('報價類別')
     A*                                     '1'-年度報價
     A*                                     '2'-活動特價
     A            CC07           8S 0       COLHDG('生效起日')
     A            CC08           8S 0       COLHDG('生效訖日')
     A            CC09           8S 2       COLHDG('單價')
     A            CC10      R               COLHDG('報價單號')
     A                                      REFFLD(CA04)
     A            CCVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CCWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CCXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CCYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CCZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          訂貨單主檔(POCDPF)        KEY=CD05
     A*****************************************************************
     A            CD01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CD02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            CD03           8S 0       COLHDG('訂貨日期')
     A            CD04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            CD05          13          COLHDG('訂貨單號')
     A            CD06      R               COLHDG('單別')
     A                                      REFFLD(L302)
     A*                                     'R1'-正常單
     A*                                     'R2'-客訂單
     A*                                     'R3'-陳列單
     A            CD07           8S 0       COLHDG('預計到貨運日')
     A            CD08           8S 0       COLHDG('預計到分店日')
     A            CD09           1          COLHDG('到貨上下午')
     A*                                     'A'-上午
     A*                                     'P'-下午
     A            CD10           4S 0       COLHDG('到貨起訖時間')
     A            CD11           1A         COLHDG('客訂運送方式')
     A*                                     '1'-供商經貨運到客戶
     A*                                     '2'-供商直送客戶
     A*                                     '3'-供商直送分店
     A            CD12           1A         COLHDG('狀態碼')
     A*                                     ' '-前台訂貨
     A*                                     'O'-後台訂貨
     A*                                     'V'-已審核
     A*                                     'A'-已核準
     A*                                     'P'-已轉驗收
     A            CD13          10          COLHDG('訂貨人')
     A            CD14          10          COLHDG('審核人')
     A            CD15          10          COLHDG('核準人')
     A            CDVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CDWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CDXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CDYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          訂貨單明細檔(POCEPF)      KEY=CE01-CE03
     A*****************************************************************
     A            CE01      R               COLHDG('訂貨單號')
     A                                      REFFLD(CD05)
     A            CE02      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CE03      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            CE04           6S 0       COLHDG('訂貨數量')
     A            CE05      R               COLHDG('確認數量')
     A                                      REFFLD(CE04)
     A            CE06      R               COLHDG('採購單號')
     A                                      REFFLD(CD05)
     A            CEVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CEWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CEXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CEYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          訂貨單客戶資料檔(POCFPF)  KEY=CF01
     A*****************************************************************
     A            CF01      R               COLHDG('訂貨單號')
     A                                      REFFLD(CD05)
     A            CF02          18O         COLHDG('客戶名稱')
     A            CF03          20A         COLHDG('客戶電話１')
     A            CF04          20A         COLHDG('客戶電話２')
     A            CF05          62O         COLHDG('客戶地址')
     A            CFVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CFWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CFXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CFYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          訂貨單供應商備註檔(POCGPF) KEY=CG01+CG02
     A*****************************************************************
     A            CG01      R               COLHDG('訂貨單號')
     A                                      REFFLD(CD05)
     A            CG02      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CG03          60O         COLHDG('備註1')
     A            CG04      R               COLHDG('備註2')
     A                                      REFFLD(CG03)
     A            CGVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CGWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CGXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CGYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          採購單主檔(POCHPF)        KEY=CH04
     A*****************************************************************
     A            CH01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CH02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            CH03      R               COLHDG('採購單日期')
     A                                      REFFLD(CD03)
     A            CH04      R               COLHDG('採購單號')
     A                                      REFFLD(CD05)
     A            CH05      R               COLHDG('單別')
     A                                      REFFLD(L302)
     A*                                     'P1'-正常單
     A*                                     'P2'-客訂單
     A*                                     'P3'-陳列單
     A            CH06      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CH07      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            CH08      R               COLHDG('預計到貨運日')
     A                                      REFFLD(CD07)
     A            CH09      R               COLHDG('預計到分店日')
     A                                      REFFLD(CD08)
     A            CH10      R               COLHDG('到貨上下午')
     A                                      REFFLD(CD09)
     A            CH11      R               COLHDG('到貨起訖時間')
     A                                      REFFLD(CD10)
     A            CH12      R               COLHDG('客訂運送方式')
     A                                      REFFLD(CD11)
     A*                                     '1'-供商經貨運到客戶
     A*                                     '2'-供商直送客戶
     A*                                     '3'-供商直送分店
     A            CH13           1          COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'S'-寄出
     A            CH14      R               COLHDG('備註1')
     A                                      REFFLD(CG03)
     A            CH15      R               COLHDG('備註2')
     A                                      REFFLD(CG04)
     A            CH16      R               COLHDG('訂貨單號')
     A                                      REFFLD(CD05)
     A            CHVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CHWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CHXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CHYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CHZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          採購單明細檔(POCIPF)      KEY=CI01-CI03
     A*****************************************************************
     A            CI01      R               COLHDG('採購單號')
     A                                      REFFLD(CH04)
     A            CI02      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CI03      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            CI04      R               COLHDG('採購數量')
     A                                      REFFLD(CE05)
     A            CI05      R               COLHDG('驗收單號')
     A                                      REFFLD(CD05)
     A            CIVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CIWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CIXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CIYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          採購單客戶資料檔(POCJPF)  KEY=CJ01
     A*****************************************************************
     A            CJ01      R               COLHDG('採購單號')
     A                                      REFFLD(CH04)
     A            CJ02      R               COLHDG('客戶名稱')
     A                                      REFFLD(CF02)
     A            CJ03      R               COLHDG('客戶電話１')
     A                                      REFFLD(CF03)
     A            CJ04      R               COLHDG('客戶電話２')
     A                                      REFFLD(CF04)
     A            CJ05      R               COLHDG('客戶地址')
     A                                      REFFLD(CF05)
     A            CJVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CJWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CJXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CJYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*   供應商出貨箱數檔(POCKPF) KEY=CK01-CK03+CK05+CK08+CK06+CK10
     A*****************************************************************
     A            CK01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CK02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            CK03      R               COLHDG('到貨運日期')
     A                                      REFFLD(CD07)
     A            CK04      R               COLHDG('到分店日期')
     A                                      REFFLD(CD07)
     A            CK05          12A         COLHDG('採購批次號碼')
     A            CK06           1A         COLHDG('運送類別')
     A*                                     '1'-一般
     A*                                     '2'-指送
     A            CK07      R               COLHDG('供商貨運區碼')
     A                                      REFFLD(NA01)
     A            CK08      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CK09      R               COLHDG('分店貨運區碼')
     A                                      REFFLD(NA01)
     A            CK10      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            CK11           4S 0       COLHDG('預估箱數')
     A            CK12      R               COLHDG('實際箱數')
     A                                      REFFLD(CK11)
     A            CK13      R               COLHDG('單價')
     A                                      REFFLD(ED04)
     A            CK14           6S 0       COLHDG('金額')
     A            CK15      R               COLHDG('訂貨單日期')
     A                                      REFFLD(CD03)
     A            CK16      R               COLHDG('到貨上下午')
     A                                      REFFLD(CD09)
     A            CK17           1A         COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'S'-寄出
     A*                                     'V'-確認
     A*                                     'P'-運費月結
     A            CK18      R               COLHDG('客訂單號')
     A                                      REFFLD(CD05)
     A            CKVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CKWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CKXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CKYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CKZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          驗收單主檔(POCLPF)        KEY=CL05
     A*****************************************************************
     A            CL01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CL02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            CL03      R               COLHDG('到分店日期')
     A                                      REFFLD(CD08)
     A            CL04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            CL05      R               COLHDG('驗收單號')
     A                                      REFFLD(CD05)
     A            CL06      R               COLHDG('單別')
     A                                      REFFLD(L302)
     A*                                     'C1'-正常單
     A*                                     'C2'-客訂單
     A*                                     'C3'-陳列單
     A            CL07      R               COLHDG('到貨運日期')
     A                                      REFFLD(CD07)
     A            CL08      R               COLHDG('到貨上下午')
     A                                      REFFLD(CD09)
     A            CL09      R               COLHDG('到貨起訖時間')
     A                                      REFFLD(CD10)
     A            CL10      R               COLHDG('客訂運送方式')
     A                                      REFFLD(CD11)
     A*                                     '1'-供商經貨運到客戶
     A*                                     '2'-供商直送客戶
     A*                                     '3'-供商直送分店
     A            CL11      R               COLHDG('供商交貨日期')
     A                                      REFFLD(CD03)
     A            CL12           1A         COLHDG('供商交貨地點')
     A*                                     '1'-貨運站
     A*                                     '2'-客戶
     A*                                     '3'-分店
     A            CL13           1A         COLHDG('驗收註記')
     A*                                     ' '-空白
     A*                                     'O'-前台有差異
     A*                                     'A'-前台多收品項
     A*                                     'B'-前台有差異及多收
     A*                                     'C'-前台無差異
     A*                                     'N'-後台補單
     A            CL14           1A         COLHDG('狀態碼')
     A*                                     ' '-前台驗收
     A*                                     'O'-後台審核
     A*                                     'R'-單據確認
     A*                                     'P'-庫存處理
     A            CL15      R               COLHDG('訂貨單號')
     A                                      REFFLD(CD05)
     A            CL16      R               COLHDG('審核人')
     A                                      REFFLD(CD14)
     A            CLVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CLWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CLXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CLYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CLZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          驗收單明細檔(POCMPF)      KEY=CM01-CM03
     A*****************************************************************
     A            CM01      R               COLHDG('驗收單號')
     A                                      REFFLD(CL05)
     A            CM02      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CM03      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            CM04      R               COLHDG('採購數量')
     A                                      REFFLD(CE05)
     A            CM05      R               COLHDG('驗收數量')
     A                                      REFFLD(CM04)
     A            CM06      R               COLHDG('確認數量')
     A                                      REFFLD(CM04)
     A            CM07      R               COLHDG('單價')
     A                                      REFFLD(CC09)
     A            CM08          11S 2       COLHDG('未稅金額')
     A            CM09          11S 2       COLHDG('稅額')
     A            CM10      R               COLHDG('採購單號')
     A                                      REFFLD(CH04)
     A            CM11      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            CM12      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            CM13      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            CM14      R               COLHDG('到分店日期')
     A                                      REFFLD(CD08)
     A            CM15      R               COLHDG('狀態碼')
     A                                      REFFLD(CL14)
     A            CM16      R               COLHDG('到貨運日期')
     A                                      REFFLD(CD08)
     A            CMVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CMWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CMXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CMYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CMZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          驗收單客戶資料檔(POCNPF)  KEY=CN01
     A*****************************************************************
     A            CN01      R               COLHDG('驗收單號')
     A                                      REFFLD(CL05)
     A            CN02      R               COLHDG('客戶名稱')
     A                                      REFFLD(CF02)
     A            CN03      R               COLHDG('客戶電話１')
     A                                      REFFLD(CF03)
     A            CN04      R               COLHDG('客戶電話２')
     A                                      REFFLD(CF04)
     A            CN05      R               COLHDG('客戶地址')
     A                                      REFFLD(CF05)
     A            CNVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            CNWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            CNXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            CNYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            CNZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          驗收單供應商備註檔(POCOPF)  KEY=CO01+CO02
     A*****************************************************************
     A            CO01      R               COLHDG('驗收單號')
     A                                      REFFLD(CL05)
     A            CO02      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            CO03      R               COLHDG('備註1')
     A                                      REFFLD(CG03)
     A            CO04      R               COLHDG('備註2')
     A                                      REFFLD(CG04)
     A            COWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            COXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            COYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            COZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          產品庫存總庫檔(INTAPF)     KEY=TA01-TA03
     A*****************************************************************
     A            TA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TA02           6S 0       COLHDG('年月')
     A            TA03      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A* 期初
     A            TA04           9S 2       COLHDG('上月單位成本')
     A            TA05          11S 2       COLHDG('期初庫存金額')
     A            TA06           6S 0       COLHDG('期初庫存量')
     A* 本期
     A            TA07      R               COLHDG('單位成本')
     A                                      REFFLD(TA04)
     A            TA08      R               COLHDG('帳列庫存金額')
     A                                      REFFLD(TA05)
     A            TA09      R               COLHDG('庫存調整金額')
     A                                      REFFLD(TA05)
     A            TA10      R               COLHDG('帳列庫存量')
     A                                      REFFLD(TA06)
     A            TA11      R               COLHDG('進貨量')
     A                                      REFFLD(TA06)
     A            TA12      R               COLHDG('退出量')
     A                                      REFFLD(TA06)
     A            TA13      R               COLHDG('調整入庫量')
     A                                      REFFLD(TA06)
     A            TA14      R               COLHDG('調整出庫量')
     A                                      REFFLD(TA06)
     A            TA15      R               COLHDG('銷售入庫量')
     A                                      REFFLD(TA06)
     A            TA16      R               COLHDG('銷售出庫量')
     A                                      REFFLD(TA06)
     A* 陳列
     A            TA17      R               COLHDG('陳列異動量')
     A                                      REFFLD(TA06)
     A            TA18      R               COLHDG('陳列期初量')
     A                                      REFFLD(TA06)
     A            TA19      R               COLHDG('陳列借貨量')
     A                                      REFFLD(TA06)
     A*
     A            TAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          產品庫存分庫檔(INTBPF)     KEY=TB01-TB05
     A*****************************************************************
     A            TB01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TB02           6S 0       COLHDG('年月')
     A            TB03      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TB04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TB05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A* 期初
     A            TB06      R               COLHDG('期初庫存量')
     A                                      REFFLD(TA06)
     A* 本期
     A            TB07      R               COLHDG('帳列庫存量')
     A                                      REFFLD(TA06)
     A            TB08      R               COLHDG('進貨量')
     A                                      REFFLD(TA06)
     A            TB09      R               COLHDG('退出量')
     A                                      REFFLD(TA06)
     A            TB10      R               COLHDG('調整入庫量')
     A                                      REFFLD(TA06)
     A            TB11      R               COLHDG('調整出庫量')
     A                                      REFFLD(TA06)
     A            TB12      R               COLHDG('銷售入庫量')
     A                                      REFFLD(TA06)
     A            TB13      R               COLHDG('銷售出庫量')
     A                                      REFFLD(TA06)
     A            TB14      R               COLHDG('調撥入在途量')
     A                                      REFFLD(TA06)
     A            TB15      R               COLHDG('調撥出在途量')
     A                                      REFFLD(TA06)
     A* 陳列
     A            TB16      R               COLHDG('陳列異動量')
     A                                      REFFLD(TA06)
     A            TB17      R               COLHDG('陳列期初量')
     A                                      REFFLD(TA06)
     A            TB18      R               COLHDG('陳列借貨量')
     A                                      REFFLD(TA06)
     A*
     A            TBVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TBWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TBXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TBYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          存貨調撥主檔(INTCPF)      KEY=TC05
     A*****************************************************************
     A            TC01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TC02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TC03           8S 0       COLHDG('調出日期')
     A            TC04      R               COLHDG('出貨分店代號')
     A                                      REFFLD(NE03)
     A            TC05      R               COLHDG('調撥單號')
     A                                      REFFLD(CD05)
     A            TC06           8S 0       COLHDG('驗收日期')
     A            TC07      R               COLHDG('收貨分店代號')
     A                                      REFFLD(NE03)
     A            TC08           1A         COLHDG('單據來源')
     A*                                     'F'-前台單據
     A*                                     'B'-後台單據
     A            TC09           1A         COLHDG('狀態碼')
     A*                                     'O'-調出待驗
     A*                                     'R'-驗收
     A*                                     'P'-庫存處理
     A            TC10           1A         COLHDG('在途處理')
     A*                                     ' '-空白
     A*                                     'T'-在途處理
     A            TCVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TCWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TCXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TCYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TCZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          存貨調撥明細檔(INTDPF)    KEY=TD01+TD02
     A*****************************************************************
     A            TD01      R               COLHDG('調撥單號')
     A                                      REFFLD(TC05)
     A            TD02      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TD03           5S 0       COLHDG('調出數量')
     A            TD04           5S 0       COLHDG('驗收數量')
     A            TD05      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TD06      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TD07      R               COLHDG('出貨分店代號')
     A                                      REFFLD(NE03)
     A            TD08      R               COLHDG('收貨分店代號')
     A                                      REFFLD(NE03)
     A            TD09           8S 0       COLHDG('調出日期')
     A            TD10           8S 0       COLHDG('驗收日期')
     A            TD11      R               COLHDG('狀態碼')
     A                                      REFFLD(TC09)
     A            TD12      R               COLHDG('在途處理')
     A                                      REFFLD(TC10)
     A            TDVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TDWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TDXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TDYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          進貨退出主檔(INTEPF)      KEY=TE05
     A*****************************************************************
     A            TE01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TE02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TE03           8S 0       COLHDG('退出日期')
     A            TE04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TE05      R               COLHDG('單據號碼')
     A                                      REFFLD(CD05)
     A            TE06           1          COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'P'-庫存處理
     A            TEVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TEWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TEXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TEYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TEZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          進貨退出明細檔(INTFPF)    KEY=TF01-TF02
     A*****************************************************************
     A            TF01      R               COLHDG('單據號碼')
     A                                      REFFLD(TE05)
     A            TF02      R               COLHDG('供應商')
     A                                      REFFLD(NB01)
     A            TF03      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TF04           5S 0       COLHDG('退出數量')
     A            TF05      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TF06      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TF07      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TF08           8S 0       COLHDG('退出日期')
     A            TF09      R               COLHDG('狀態碼')
     A                                      REFFLD(TE06)
     A            TFVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TFWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TFXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TFYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TFZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          陳列轉進貨主檔(INTGPF)    KEY=TG05
     A*****************************************************************
     A            TG01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TG02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TG03           8S 0       COLHDG('轉進貨日期')
     A            TG04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TG05      R               COLHDG('單據號碼')
     A                                      REFFLD(CD05)
     A            TG06      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            TG07           1A         COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'P'-庫存處理
     A            TGVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TGWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TGXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TGYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TGZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          陳列轉進貨明細檔(INTHPF)  KEY=TH01-TH02
     A*****************************************************************
     A            TH01      R               COLHDG('單據號碼')
     A                                      REFFLD(TG05)
     A            TH02      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TH03      R               COLHDG('轉進貨量')
     A                                      REFFLD(CE05)
     A            TH04      R               COLHDG('進貨單價')
     A                                      REFFLD(CC09)
     A            TH05      R               COLHDG('驗收單號')
     A                                      REFFLD(CL05)
     A            TH06      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TH07      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TH08      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TH09           8S 0       COLHDG('轉進貨日期')
     A            TH10      R               COLHDG('狀態碼')
     A                                      REFFLD(TG07)
     A            THVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            THWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            THXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            THYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            THZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          存貨調整主檔(INTIPF) KEY=TI05
     A*****************************************************************
     A            TI01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TI02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TI03           8S 0       COLHDG('調整日期')
     A            TI04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TI05      R               COLHDG('單據號碼')
     A                                      REFFLD(CD05)
     A            TI06           2A         COLHDG('原因代碼')
     A            TI07           1A         COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'P'-庫存處理
     A            TIVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TIWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TIXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TIYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TIZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          存貨調整明細檔(INTJPF) KEY=TJ01-TJ02
     A*****************************************************************
     A            TJ01      R               COLHDG('單據號碼')
     A                                      REFFLD(TI05)
     A            TJ02      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TJ03           5S 0       COLHDG('調整數量')
     A*                                     正值-調入
     A*                                     負值-調出
     A            TJ04      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TJ05      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TJ06      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TJ07           8S 0       COLHDG('調整日期')
     A            TJ08      R               COLHDG('狀態碼')
     A                                      REFFLD(TI07)
     A            TJVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TJWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TJXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TJYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TJZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          陳列品退出主檔(INTKPF)    KEY=TK05
     A*****************************************************************
     A            TK01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TK02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TK03           8S 0       COLHDG('退出日期')
     A            TK04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TK05      R               COLHDG('單據號碼')
     A                                      REFFLD(CD05)
     A            TK06      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            TK07           1A         COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'P'-庫存處理
     A            TKVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TKWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TKXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TKYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TKZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          陳列品退出明細檔(INTLPF)  KEY=TL01-TL02
     A*****************************************************************
     A            TL01      R               COLHDG('單據號碼')
     A                                      REFFLD(TK05)
     A            TL02      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TL03      R               COLHDG('退出量')
     A                                      REFFLD(CE05)
     A            TL04      R               COLHDG('驗收單號')
     A                                      REFFLD(CL05)
     A            TL05      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TL06      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TL07      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TL08           8S 0       COLHDG('退出日期')
     A            TL09      R               COLHDG('狀態碼')
     A                                      REFFLD(TG07)
     A            TLVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TLWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TLXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TLYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TLZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          產品成本調整資料檔(INTMPF) KEY=TM08
     A*****************************************************************
     A            TM01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TM02           8S 0       COLHDG('調整日期')
     A            TM03      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TM04      R               COLHDG('調整前庫存金額')
     A                                      REFFLD(TA05)
     A            TM05      R               COLHDG('調整金額')
     A                                      REFFLD(TA05)
     A            TM06           2A         COLHDG('原因代碼')
     A            TM07           1A         COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'P'-已處理
     A            TM08      R               COLHDG('單據號碼')
     A                                      REFFLD(CD05)
     A            TM09          62O         COLHDG('備註')
     A            TMVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TMWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TMXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TMYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TMZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          陳列品資料檔(INTNPF)  KEY=TN01-TN05+TN09
     A*****************************************************************
     A            TN01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TN02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TN03      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            TN04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TN05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TN06      R               COLHDG('陳列進價')
     A                                      REFFLD(CC09)
     A            TN07      R               COLHDG('陳列餘量')
     A                                      REFFLD(CE05)
     A            TN08      R               COLHDG('到分店日期')
     A                                      REFFLD(CL03)
     A            TN09      R               COLHDG('陳列驗收單號')
     A                                      REFFLD(CL05)
     A            TN10      R               COLHDG('陳列採購單號')
     A                                      REFFLD(CH04)
     A            TN11      R               COLHDG('已預轉進貨量')
     A                                      REFFLD(CE05)
     A            TN12      R               COLHDG('已預退出量')
     A                                      REFFLD(CE05)
     A            TN13      R               COLHDG('已借貨量')
     A                                      REFFLD(CE05)
     A            TN14      R               COLHDG('陳列驗收量')
     A                                      REFFLD(CE05)
     A            TN15      R               COLHDG('到貨運日期')
     A                                      REFFLD(CL03)
     A            TNVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TNWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TNXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TNYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TNZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*         陳列品資料工作檔(INTNWF)  KEY=TNW01-TNW05
     A*****************************************************************
     A            TNW01     R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TNW02     R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TNW03     R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TNW04     R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TNW05     R               COLHDG('陳列驗收單號')
     A                                      REFFLD(CL05)
     A            TNW06     R               COLHDG('已借貨量')
     A                                      REFFLD(CE05)
     A*****************************************************************
     A*          銷售陳借異動檔(INTPPF) KEY=TP01-TP05
     A*****************************************************************
     A            TP01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TP02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TP03      R               COLHDG('銷售日期')
     A                                      REFFLD(CL03)
     A            TP04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TP05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TP06      R               COLHDG('借貨數量')
     A                                      REFFLD(CE05)
     A            TP07      R               COLHDG('陳列進價')
     A                                      REFFLD(TN06)
     A            TP08      R               COLHDG('未稅金額')
     A                                      REFFLD(CM08)
     A            TP09      R               COLHDG('含稅金額')
     A                                      REFFLD(CM08)
     A            TP10      R               COLHDG('借貨單號')
     A                                      REFFLD(CD05)
     A            TP11      R               COLHDG('銷售序號')
     A                                      REFFLD(CD05)
     A            TP12      R               COLHDG('陳列驗收單號')
     A                                      REFFLD(TN09)
     A            TP13      R               COLHDG('供應商代號')
     A                                      REFFLD(TN03)
     A            TP14           1A         COLHDG('狀態碼')
     A            TPVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TPWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TPXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TPYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TPZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          陳列調整異動檔(INTRPF) KEY=TR01-TR05
     A*****************************************************************
     A            TR01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TR02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TR03      R               COLHDG('銷售日期')
     A                                      REFFLD(CL03)
     A            TR04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TR05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TR06      R               COLHDG('借貨數量')
     A                                      REFFLD(CE05)
     A            TR07      R               COLHDG('陳列進價')
     A                                      REFFLD(TN06)
     A            TR08      R               COLHDG('未稅金額')
     A                                      REFFLD(CM08)
     A            TR09      R               COLHDG('含稅金額')
     A                                      REFFLD(CM08)
     A            TR10      R               COLHDG('借貨單號')
     A                                      REFFLD(CD05)
     A            TR11      R               COLHDG('調整單號')
     A                                      REFFLD(CD05)
     A            TR12      R               COLHDG('陳列驗收單號')
     A                                      REFFLD(TN09)
     A            TR13      R               COLHDG('供應商代號')
     A                                      REFFLD(TN03)
     A            TR14           1A         COLHDG('狀態碼')
     A            TRVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TRWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TRXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TRYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TRZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          銷售陳借工作檔(INTPWF) KEY=TPW01-TPW03
     A*****************************************************************
     A            TPW01     R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TPW02     R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TPW03     R               COLHDG('銷借日期')
     A                                      REFFLD(CL03)
     A            TPW04     R               COLHDG('工作單號')
     A                                      REFFLD(TN09)
     A            TPW05     R               COLHDG('陳列進價')
     A                                      REFFLD(TN06)
     A            TPW06     R               COLHDG('銷借數量')
     A                                      REFFLD(CE05)
     A            TPW07          1A         COLHDG('狀態碼')
     A*****************************************************************
     A*          銷售無庫異動檔(INTQPF) KEY=TQ01-TQ05
     A*****************************************************************
     A            TQ01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            TQ02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            TQ03      R               COLHDG('銷售日期')
     A                                      REFFLD(CL03)
     A            TQ04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            TQ05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            TQ06      R               COLHDG('銷售數量')
     A                                      REFFLD(CE05)
     A            TQ07      R               COLHDG('單價')
     A                                      REFFLD(TN06)
     A            TQ08      R               COLHDG('未稅金額')
     A                                      REFFLD(CM08)
     A            TQ09      R               COLHDG('含稅金額')
     A                                      REFFLD(CM08)
     A            TQ10      R               COLHDG('銷售無庫單號')
     A                                      REFFLD(CD05)
     A            TQ11      R               COLHDG('銷售序號')
     A                                      REFFLD(CD05)
     A            TQ12           1A         COLHDG('狀態碼')
     A            TQVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            TQWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            TQXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            TQYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            TQZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
WB00+A*****************************************************************
WB00+A*          缺貨產品資料檔(INTSPF)    KEY=TS01+TS02+TS03
WB00+A*****************************************************************
WB00+A            TS01      R               COLHDG('公司別')
WB00+A                                      REFFLD(NC01)
WB00+A            TS02      R               COLHDG('通路代號')
WB00+A                                      REFFLD(ND02)
WB00+A            TS03      R               COLHDG('產品代號')
WB00+A                                      REFFLD(NC02)
WB00+A            TS04      R               COLHDG('預計到貨日')
WB00+A                                      REFFLD(CL03)
WB00+A            TS05      R               COLHDG('缺貨數量')
WB00+A                                      REFFLD(CE05)
WB00+A            TS06      R               COLHDG('備註')
WB00+A                                      REFFLD(NC26)
WB00+A            TSVV      R               COLHDG('建檔日期')
WB00+A                                      REFFLD(L2VV)
WB00+A            TSWW      R               COLHDG('異動程式')
WB00+A                                      REFFLD(L2WW)
WB00+A            TSXX      R               COLHDG('異動日期')
WB00+A                                      REFFLD(L2XX)
WB00+A            TSYY      R               COLHDG('異動時間')
WB00+A                                      REFFLD(L2YY)
WB00+A            TSZZ      R               COLHDG('異動者　')
WB00+A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          通路銷售資料檔(SEHAPF)    KEY=HA01-HA05
     A*****************************************************************
     A            HA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            HA02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            HA03           8S 0       COLHDG('銷售日期')
     A            HA04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            HA05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            HA06           5S 0       COLHDG('數量')
     A            HA07           9S 0       COLHDG('未稅金額')
     A            HA08           9S 0       COLHDG('含稅金額')
     A            HA09      R               COLHDG('批次號碼')
     A                                      REFFLD(CD05)
     A            HA10           1A         COLHDG('狀態碼')
     A*                                     ' '-空白
     A*                                     'P'-庫存處理
     A            HAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            HAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            HAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            HAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            HAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          VIP資料檔(VPAAPF)   KEY=AA01+AA02
     A*****************************************************************
     A            AA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            AA02      R               COLHDG('行動電話')
     A                                      REFFLD(CF04)
     A            AA03      R               COLHDG('客戶姓名')
     A                                      REFFLD(CF02)
     A            AA04           1A         COLHDG('性別')
     A*                                     M-男
     A*                                     F-女
     A            AA05      R               COLHDG('聯絡地址')
     A                                      REFFLD(CF05)
     A            AA06           1A         COLHDG('狀態碼')
     A*                                     A-有效
     A*                                     B-無效
     A            AAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            AAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            AAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            AAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            AAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*         VIP銷貨明細檔(VPSDPF)       KEY=SD01+SD02+SD03
     A*                                          +SD04+SD05+SD06
     A*****************************************************************
     A            SD01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            SD02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            SD03      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            SD04      R               COLHDG('銷售日期')
     A                                      REFFLD(CL03)
     A            SD05      R               COLHDG('行動電話')
     A                                      REFFLD(CF04)
     A            SD06      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            SD07      R               COLHDG('銷售數量')
     A                                      REFFLD(CE04)
     A            SD08           9  0       COLHDG('售價')
     A            SD09          42O         COLHDG('購買目的')
     A            SDVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            SDWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            SDXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            SDYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            SDZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          每月盤點主檔(PIZAPF)      KEY=ZA01+ZA02+ZA05
     A*****************************************************************
     A            ZA01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            ZA02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            ZA03      R               COLHDG('盤點日期')
     A                                      REFFLD(CD03)
     A            ZA04      R               COLHDG('分店代號')
     A                                      REFFLD(NE03)
     A            ZA05      R               COLHDG('盤點單號')
     A                                      REFFLD(CD05)
     A            ZA06      R               COLHDG('單別')
     A                                      REFFLD(L302)
     A            ZA07           1A         COLHDG('狀態碼')
     A            ZA08      R               COLHDG('列印日期')
     A                                      REFFLD(CD03)
     A            ZA09      R               COLHDG('結案日期')
     A                                      REFFLD(CD03)
     A            ZAVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            ZAWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            ZAXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            ZAYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            ZAZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
     A*****************************************************************
     A*          每月盤點明細檔(PIZBPF)      KEY=ZB01+ZB02+ZB03+
     A*                                            ZB04+ZB05
     A*****************************************************************
     A            ZB01      R               COLHDG('公司別')
     A                                      REFFLD(NC01)
     A            ZB02      R               COLHDG('通路代號')
     A                                      REFFLD(ND02)
     A            ZB03      R               COLHDG('盤點單號')
     A                                      REFFLD(CD05)
     A            ZB04      R               COLHDG('供應商代號')
     A                                      REFFLD(NB01)
     A            ZB05      R               COLHDG('產品代號')
     A                                      REFFLD(NC02)
     A            ZB06      R               COLHDG('盤點數量')
     A                                      REFFLD(CE04)
     A            ZB07      R               COLHDG('確認數量')
     A                                      REFFLD(CE04)
     A            ZBVV      R               COLHDG('建檔日期')
     A                                      REFFLD(L2VV)
     A            ZBWW      R               COLHDG('異動程式')
     A                                      REFFLD(L2WW)
     A            ZBXX      R               COLHDG('異動日期')
     A                                      REFFLD(L2XX)
     A            ZBYY      R               COLHDG('異動時間')
     A                                      REFFLD(L2YY)
     A            ZBZZ      R               COLHDG('異動者　')
     A                                      REFFLD(L2ZZ)
W300+A*****************************************************************
W300+A*          產品條碼對照檔(C#ELPF) KEY=EL01-EL04
W300+A*****************************************************************
W300+A            EL01      R               COLHDG('公司別')
W300+A                                      REFFLD(NC01)
W300+A            EL02      R               COLHDG('通路代號')
W300+A                                      REFFLD(ND02)
W300+A            EL03      R               COLHDG('公司產品代號')
W300+A                                      REFFLD(NC02)
W300+A            EL04          15          COLHDG('產品條碼代號')
W300+A            EL05          13          COLHDG('通路產品代號')
