     A*****************************************************************
     A*       家樂福銷售工作檔２(SCWK03)  KEY=WK0301-WK0305
     A*****************************************************************
     A          R WK030                     PFLILE(SCWK03)
     A*
     A          K WK0301
     A          K WK0302
     A          K WK0304
     A          K WK0303
     A          K WK0305
