     A          R QB0
     A*
     A            QB01           9A         COLHDG('產品代號')
     A            QB02          62O         COLHDG('品名')
     A            QB03           8S 2       COLHDG('標準未稅成本')
     A            QB04           9S 0       COLHDG('含稅銷售金額')
     A            QB05           5S 0       COLHDG('銷售數量')
     A            QB06           9S 0       COLHDG('含稅銷貨成本')
     A            QB07           5S 2       COLHDG('活動進價%')
     A*
     A          K QB01
