     A          R QC0
     A*
     A            QC01           5A         COLHDG('分店代號')
     A            QC02           9A         COLHDG('產品代號')
     A            QC03          62O         COLHDG('品名')
     A            QC04           9S 0       COLHDG('含稅銷售金額')
     A            QC05           5S 0       COLHDG('銷售數量')
     A            QC06           7S 2       COLHDG('抽成獎金')
     A*
     A          K QC01
     A          K QC02
