     A          R QF0
     A*
     A            QF01          12A         COLHDG('家樂福CODE')
     A            QF02           9A         COLHDG('產品代號')
     A            QF03          62O         COLHDG('品名')
     A            QF04           8S 0       COLHDG('活動日期起')
     A            QF05           8S 0       COLHDG('活動日期迄')
     A            QF06           9S 0       COLHDG('最低價格')
     A            QF07           5S 0       COLHDG('獎金')
     A*
     A          K QF02
