     A*****************************************************************
     A*          代碼值設定檔(UTL2PF)   KEY=L201+L202
     A*****************************************************************
     A          R L20                       PFILE(UTL2PF)
     A*
     A**          L201           8          COLHDG('代碼欄位')
     A**          L202          10          COLHDG('代碼內容')
     A*
     A          K L201
     A          K L202
