     A*****************************************************************
     A*          ¥ð°²¤é©w¸qÀÉ(UTL4PF)   KEY=L201+L202
     A*****************************************************************
     A          R L40                       PFILE(UTL4PF)
      *
     A          K L401                      DESCEND
