     A*****************************************************************
     A*          前台表單寄出程式用E-MAIL位址 (UTL5PF)
     A*****************************************************************
     A*                                     REF(SCRF)
     A*                                     UNIQUE
     A          R L50
     A            L501          64O         COLHDG('EMAIL')
     A            L502           1A         COLHDG('狀態')
      * "Y" - 為生效，" " OR "N" 為無效
     A*
