     A*****************************************************************
     A*          VIP¸ê®ÆÀÉ(VPAAPF)   KEY=AA01+AA03+AA02
     A*****************************************************************
     A          R AA0                       PFILE(VPAAPF)
     A*
     A          K AA01
     A          K AA03
     A          K AA02
